#include <stdio.h>

int main() {
    int price = -1;      // सामान की कीमत (शुरुआत में -1 रख रहे हैं ताकि लूप चालू हो सके)
    int total_bill = 0; // कुल बिल जोड़ने के लिए

    printf("---  वेलकम टू सुपरमार्केट बिलिंग  ---\n");
    printf("(गेम/बिल रोकने के लिए 0 दबाएं)\n\n");

    // जब तक कीमत 0 के बराबर नहीं (!=) हो जाती, लूप चलाते रहो
    while (price != 0) {
        printf("सामान की कीमत डालें: ₹");
        scanf("%d", &price);

        // जो भी कीमत यूजर ने डाली है, उसे टोटल बिल में जोड़ते जाओ
        total_bill = total_bill + price;
    }

    // लूप ख़त्म होने के बाद कुल बिल प्रिंट होगा
    printf("\n-----------------------------------\n");
    printf(" आपका कुल बिल हुआ: ₹%d\n", total_bill);
    printf("विजिट करने के लिए धन्यवाद! \n");

    return 0;
}
